In [36]:
import pandas as pd

In [2]:
len?

In [3]:
list?

In [4]:
def print_hello(name):
    sentence="Hello"+" "+ name
    print(sentence)

In [5]:
print_hello("Sam")

Hello Sam

In [9]:
def add_10(value):
    num=value+10
    return(num)

In [10]:
type(add_10(100))

int

In [12]:
type(range(0))

range

In [14]:
for i in range(10):
    print( i)

0
1
2
3
4
5
6
7
8
9

In [15]:
L1=[1,2,3]
L2=[2,4,6]

In [16]:
def add_list(l1,l2):
    l3 = []
    for i in range(len(l1)):
        l3.append(l1[i]+l2[i])
    return(l3)

In [17]:
add_list(L1,L2)

[3, 6, 9]

In [19]:
def add_list_2(l1,l2):
    return [l1[i]+l2[i] for i in range(len(l1))]

In [20]:
add_list_2(L1,L2)

[3, 6, 9]

In [21]:
test1={"Monday":"Shopping","Tuesday":"Reading","Wednesday":"Sleeping","Thursday":"Working","Friday":"Reading"}

In [22]:
test1["Saturday"]="Sleeping"

In [23]:
print(test1)

{'Monday': 'Shopping', 'Tuesday': 'Reading', 'Wednesday': 'Sleeping', 'Thursday': 'Working', 'Friday': 'Reading', 'Saturday': 'Sleeping'}

In [24]:
test1["Monday"] = ["Sleeping", "Working"]

In [25]:
print(test1)

{'Monday': ['Sleeping', 'Working'], 'Tuesday': 'Reading', 'Wednesday': 'Sleeping', 'Thursday': 'Working', 'Friday': 'Reading', 'Saturday': 'Sleeping'}

In [31]:
print(list(test1.values()))

TypeError: values() takes no arguments (1 given)

In [32]:
test1.values()

dict_values([['Sleeping', 'Working'], 'Reading', 'Sleeping', 'Working', 'Reading', 'Sleeping'])

In [35]:
type(test1["Monday"])

list

In [37]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [38]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [39]:
type(data)

pandas.core.series.Series

pandas.Series:
1. support multiple index
2. each element is the same type

In [40]:
S1=pd.Series([26000,300,5,170],index=["HSI","0700.HK","1398.HK","388.HK"])

In [41]:
S1[S1>100]

HSI        26000
0700.HK      300
388.HK       170
dtype: int64

In [43]:
S1.loc["1398.HK"]

5

In [46]:
S1.iloc[-1]

170

In [64]:
S1.index[S1==300]

Index(['0700.HK'], dtype='object')

In [54]:
df2=pd.DataFrame({"First_Name":["Peter","Victor","Albert","Alice"],
                 "ID":[1,2,3,4],
                 "Income":[1000,20000,3000,2000],
                 },index=["A1","A2","A3","A4"])
df2

   First_Name  ID  Income
A1      Peter   1    1000
A2     Victor   2   20000
A3     Albert   3    3000
A4      Alice   4    2000

In [55]:
df2["Income"]>3000

A1    False
A2     True
A3    False
A4    False
Name: Income, dtype: bool

In [58]:
df2[df2["Income"]>3000]

   First_Name  ID  Income
A2     Victor   2   20000

In [59]:
df2.loc[["A2","A3"]]

   First_Name  ID  Income
A2     Victor   2   20000
A3     Albert   3    3000

In [61]:
df2.iloc[:-1,] #[row,col]

   First_Name  ID  Income
A1      Peter   1    1000
A2     Victor   2   20000
A3     Albert   3    3000

In [63]:
df2.iloc[:-1,1:] #drop last row ,drop first column

    ID  Income
A1   1    1000
A2   2   20000
A3   3    3000